lib/tasks/admin.rake

SELECT "users".* FROM "users" WHERE "users"."email_address" = 'admin@example.com' LIMIT 1
---
  task create: :environment do
    require "io/console"

    email = ENV["ADMIN_EMAIL"].presence
    unless email
      print "Admin email: "
      email = $stdin.gets.to_s.strip
    end

    password = ENV["ADMIN_PASSWORD"].presence
    unless password
      print "Admin password (min 8 chars): "
      password = $stdin.noecho(&:gets).to_s.strip
      puts
    end

    if email.blank? || password.blank?
      abort "Email and password are required."
    end

    user = User.find_or_initialize_by(email_address: email)