app/views/practitioner/specialty/edit.html.erb

        <%= f.label :specialty_id, "Hauptfachgebiet", class: "form-field__label" %>
        <%= f.select :specialty_id,
              options_from_collection_for_select(@specialties, :id, :name, @practitioner.specialty_id),
              { include_blank: "— Wählen Sie eine Option —" },
              class: "form-field__input" %>
---
SELECT "specialties".* FROM "specialties" ORDER BY LOWER(name)

    <div class="tag-input" data-tag-input-target="container">
      <% @practitioner.focus_areas.alphabetical.each do |fa| %>
---
SELECT "focus_areas".* FROM "focus_areas" ORDER BY LOWER(name)