app/views/admin/practitioners/_form.html.erb

            <label>
              <%= check_box_tag "practitioner[specialty_ids][]", specialty.id,
                    practitioner.specialty_ids.include?(specialty.id) %>
---
SELECT "specialties"."id" FROM "specialties" INNER JOIN "practitioner_specialties" ON "specialties"."id" = "practitioner_specialties"."specialty_id" WHERE "practitioner_specialties"."practitioner_id" = 2

          <% end %>
          <% if Specialty.count.zero? %>
---
SELECT COUNT(*) FROM "specialties"