app/views/admin/practitioners/_invitation_panel.html.erb

          This profile was claimed <%= time_ago_in_words(practitioner.claimed_at) %> ago
          <% if practitioner.user&.email_address.present? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1