app/views/admin/practitioners/_row.html.erb

SELECT "specialties".* FROM "specialties" ORDER BY LOWER(name)
---
    <div class="row" style="gap: 4px;">
      <% practitioner.specialties.first(3).each do |s| %>