app/controllers/admin/practitioners_controller.rb

SELECT "specialties".* FROM "specialties" WHERE "specialties"."id" IN (1, 2)
SELECT DISTINCT "practitioners"."city" FROM "practitioners" WHERE NOT (("practitioners"."city" = '' OR "practitioners"."city" IS NULL)) ORDER BY "practitioners"."city" ASC
---
    scope = Practitioner.includes(:specialties, :latest_claim_invitation)
                        .by_name(@filters[:q])
                        .by_city(@filters[:city])
                        .with_specialty(@filters[:specialty_id])

SELECT DISTINCT "practitioners"."city" FROM "practitioners" WHERE NOT (("practitioners"."city" = '' OR "practitioners"."city" IS NULL)) ORDER BY "practitioners"."city" ASC
---
    scope = scope.order(Arel.sql("#{sort_column} #{sort_dir}"))

    @cities = Practitioner.where.not(city: [nil, ""]).distinct.order(:city).pluck(:city)

INSERT INTO "practitioners" ("salutation", "full_name", "street_address", "postal_code", "city", "bundesland", "phone", "public_email", "website_url", "latitude", "longitude", "published", "claimed_at", "user_id", "created_at", "updated_at", "slug", "short_tagline", "services_offered", "languages_spoken", "qualifications", "years_in_practice", "opening_hours") VALUES ('Dr.', 'Sarah Jenks', 'Kastanienallee 12', '10435', 'Berlin', 'Berlin', '49 30 12345001', 'sarah.jenks@example.de', '', 52.53929, 13.409657, TRUE, NULL, NULL, '2026-07-30 13:47:37.913098', '2026-07-30 13:47:37.913098', 'sarah-jenks-berlin', NULL, NULL, NULL, NULL, NULL, '{}') RETURNING "id"
---
  def create
    @practitioner = Practitioner.new(practitioner_params)
    if @practitioner.save

UPDATE "practitioners" SET "published" = TRUE, "updated_at" = '2026-07-30 13:04:35.695349' WHERE "practitioners"."id" = 5
---
  def update
    if @practitioner.update(practitioner_params)

SELECT "practitioners".* FROM "practitioners" WHERE "practitioners"."id" = 2 LIMIT 1
---
  def bulk_destroy
    deleted = Practitioner.where(id: bulk_ids).destroy_all.size

SELECT "practitioners".* FROM "practitioners" WHERE "practitioners"."slug" = 'anna-muller-munchen' LIMIT 1
INSERT INTO "claim_invitations" ("practitioner_id", "unique_token", "email_sent_to", "sent_at", "expires_at", "claimed_at", "created_at", "updated_at") VALUES (4, 'S2Exzzi_TBmXKeod1UNVQXUAVwWTCBtilZSKtZyv2F0', 'anna@example.com', '2026-07-30 10:08:31.440787', '2026-08-29 10:08:31.440740', NULL, '2026-07-30 10:08:31.441296', '2026-07-30 10:08:31.441296') RETURNING "id"
---
  def send_claim_invitation
    practitioner = Practitioner.find_by!(slug: params[:id])

    if practitioner.claimed?
      redirect_to edit_admin_practitioner_path(practitioner),
                  alert: "This profile has already been claimed."
      return
    end

    email = params[:email].to_s.strip
    unless email.match?(URI::MailTo::EMAIL_REGEXP)
      redirect_to edit_admin_practitioner_path(practitioner),
                  alert: "Please provide a valid email address."
      return
    end

    ClaimInvitation.invalidate_pending_for(practitioner)

    invitation = practitioner.claim_invitations.create!(
      email_sent_to: email
    )

SELECT "practitioners".* FROM "practitioners" WHERE "practitioners"."slug" = 'anna-muller-munchen' LIMIT 1
---
  def set_practitioner
    @practitioner = Practitioner.find_by!(slug: params[:id])