app/controllers/admin/specialties_controller.rb

INSERT INTO "specialties" ("name", "slug", "description", "created_at", "updated_at", "search_aliases") VALUES ('Nutrition', 'nutrition', 'Dietitians and nutritionists are experts in the use of food and nutrition to promote health and manage disease.', '2026-08-02 08:54:15.956329', '2026-08-02 08:54:15.956329', 'Nutritionist') RETURNING "id"
---
  def create
    @specialty = Specialty.new(specialty_params)
    if @specialty.save

UPDATE "specialties" SET "description" = 'Osteopathy is a type of alternative healthcare focused on physical manipulation of the body''s muscles, joints, and bones', "updated_at" = '2026-08-02 09:02:25.152549', "search_aliases" = 'Osteopath' WHERE "specialties"."id" = 4
---
  def update
    if @specialty.update(specialty_params)

SELECT "specialties".* FROM "specialties" WHERE "specialties"."id" = 6 LIMIT 1
---
  def set_specialty
    @specialty = Specialty.find(params[:id])