app/views/public/practitioners/show.html.erb


      <% if @practitioner.focus_areas.any? %>
---
SELECT "practitioner_focus_areas".* FROM "practitioner_focus_areas" WHERE "practitioner_focus_areas"."practitioner_id" = 13