app/views/public/practitioners/show.html.erb

<%
  first_specialty = @practitioner.specialties.first&.name
---
SELECT "specialties".* FROM "specialties" INNER JOIN "practitioner_specialties" ON "specialties"."id" = "practitioner_specialties"."specialty_id" WHERE "practitioner_specialties"."practitioner_id" = 4 ORDER BY "specialties"."id" ASC LIMIT 1


      <% if @practitioner.specialties.any? %>
---
SELECT 1 AS one FROM "specialties" INNER JOIN "practitioner_specialties" ON "specialties"."id" = "practitioner_specialties"."specialty_id" WHERE "practitioner_specialties"."practitioner_id" = 4 LIMIT 1

          <ul class="profile-focus__list">
            <% @practitioner.specialties.each do |specialty| %>
---
SELECT "specialties".* FROM "specialties" INNER JOIN "practitioner_specialties" ON "specialties"."id" = "practitioner_specialties"."specialty_id" WHERE "practitioner_specialties"."practitioner_id" = 4


      <% if @practitioner.treatments.any? %>
---
SELECT "treatments".* FROM "treatments" WHERE "treatments"."practitioner_id" = 4