app/controllers/public/claims_controller.rb

INSERT INTO "users" ("email_address", "password_digest", "role", "created_at", "updated_at", "pending_email_address", "email_change_token", "email_change_sent_at", "deleted_at") VALUES ('james.liu@example.de', '$2a$12$TnOnRBMT9qOv9HIX0tLJ/Oo0CsIJCmbxQ9Ab9Qzgfj0k2SzFclfgW', 'practitioner', '2026-07-30 13:12:51.048385', '2026-07-30 13:12:51.048385', NULL, NULL, NULL, NULL) RETURNING "id"
UPDATE "practitioners" SET "claimed_at" = '2026-07-30 10:09:09.509330', "user_id" = 2, "updated_at" = '2026-07-30 10:09:09.515142' WHERE "practitioners"."id" = 4
---
  def create
    if @invitation.nil? || !@invitation.pending?
      return render_state
    end

    email = params[:email].to_s.strip.downcase
    password = params[:password].to_s

    @submitted_email = email
    @error = nil

    if email.blank? || !email.match?(URI::MailTo::EMAIL_REGEXP)
      @error = "Please provide a valid email address."
      return render :show, status: :unprocessable_content
    end
    if password.length < 8
      @error = "Password must be at least 8 characters."
      return render :show, status: :unprocessable_content
    end

    user = nil
    ActiveRecord::Base.transaction do
      user = User.new(email_address: email, password: password, role: :practitioner)
      user.save!

      practitioner = @invitation.practitioner
      practitioner.update!(user: user, claimed_at: Time.current)

SELECT "claim_invitations".* FROM "claim_invitations" WHERE "claim_invitations"."unique_token" = 'S2Exzzi_TBmXKeod1UNVQXUAVwWTCBtilZSKtZyv2F0' LIMIT 1
---
  def set_invitation
    @invitation = ClaimInvitation.find_by(unique_token: params[:token])