app/controllers/public/email_changes_controller.rb

SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."email_change_token" = 'H2G6Kv13ZjMxGtOHDlgeQDb_IytBWnG35wlI5BlPOM0' LIMIT 1
---
  def show
    user = User.active.find_by(email_change_token: params[:token])