app/controllers/public/home_controller.rb

    scope = Practitioner.published
                        .includes(:specialty, :focus_areas)
                        .with_attached_profile_photo
                        .by_query(@filters[:q])
                        .by_location(@filters[:near])
                        .order(Arel.sql("LOWER(full_name)"))
---
SELECT "practitioner_focus_areas".* FROM "practitioner_focus_areas" WHERE "practitioner_focus_areas"."practitioner_id" IN (12, 4, 13, 3, 11, 5, 8, 7, 10, 6, 9)
SELECT "specialties".* FROM "specialties" WHERE "specialties"."id" IN (3, 4)
SELECT DISTINCT "practitioners".* FROM "practitioners" LEFT OUTER JOIN "practitioner_specialties" ON "practitioner_specialties"."practitioner_id" = "practitioners"."id" LEFT OUTER JOIN "specialties" ON "specialties"."id" = "practitioner_specialties"."specialty_id" WHERE "practitioners"."published" = TRUE AND (practitioners.full_name ILIKE '%Homöopathie%' OR specialties.name ILIKE '%Homöopathie%') LIMIT 1 OFFSET 0