app/controllers/public/practitioners_controller.rb

SELECT "focus_areas".* FROM "focus_areas" WHERE "focus_areas"."id" IN (1, 2)
SELECT "practitioners".* FROM "practitioners" WHERE "practitioners"."published" = TRUE AND "practitioners"."slug" = 'dr-maria-schmidt-berlin' LIMIT 1
SELECT "specialties".* FROM "specialties" WHERE "specialties"."id" IN (3, 4)
---
  def show
    @practitioner = Practitioner.published
                                .includes(:specialty, :focus_areas, :treatments)
                                .with_attached_profile_photo
                                .with_attached_gallery_images
                                .find_by!(slug: params[:slug])