app/controllers/public/registrations_controller.rb

  def create
    @form = registration_defaults.merge(sanitized_params)
    @specialties = Specialty.alphabetical

    email = @form[:email].to_s.strip.downcase
    full_name = @form[:full_name].to_s.strip
    city = @form[:city].to_s.strip

    if email.blank? || !email.match?(URI::MailTo::EMAIL_REGEXP)
      flash.now[:alert] = "Please provide a valid email address."
      return render :new, status: :unprocessable_content
    end
    if full_name.blank? || city.blank?
      flash.now[:alert] = "Full name and city are required."
      return render :new, status: :unprocessable_content
    end

    if User.exists?(["LOWER(email_address) = ?", email])
---
SELECT 1 AS one FROM "users" WHERE (LOWER(email_address) = 'david.klein@example.de') LIMIT 1

    practitioner = match || build_new_practitioner(full_name: full_name, city: city)

    unless practitioner.persisted?
      unless practitioner.save
---
INSERT INTO "practitioners" ("salutation", "full_name", "street_address", "postal_code", "city", "bundesland", "phone", "public_email", "website_url", "latitude", "longitude", "published", "claimed_at", "user_id", "created_at", "updated_at", "slug", "short_tagline", "qualifications", "opening_hours", "gallery_order") VALUES (NULL, 'David Klein', 'Prager Strasse 12', '01069', 'Dresden', NULL, '49 351 12345009', NULL, NULL, 51.046396, 13.737261, FALSE, NULL, NULL, '2026-08-02 13:40:11.843820', '2026-08-02 13:40:11.843820', 'david-klein-dresden', 'Massage Therapist', NULL, '{}', '[]') RETURNING "id"

    end

    ClaimInvitation.invalidate_pending_for(practitioner)
    invitation = practitioner.claim_invitations.create!(email_sent_to: email)
---
INSERT INTO "claim_invitations" ("practitioner_id", "unique_token", "email_sent_to", "sent_at", "expires_at", "claimed_at", "created_at", "updated_at") VALUES (13, 'lq7rPAvkpsF2i149SZQz5iw6n1bX3urdrcgj4UIq2jk', 'david.klein@example.de', '2026-08-02 13:40:11.878243', '2026-09-01 13:40:11.878080', NULL, '2026-08-02 13:40:11.879966', '2026-08-02 13:40:11.879966') RETURNING "id"