app/controllers/practitioner/accounts_controller.rb

UPDATE "users" SET "updated_at" = '2026-07-30 10:54:04.640643', "deleted_at" = '2026-07-30 10:54:04.639287' WHERE "users"."id" = 2
UPDATE "practitioners" SET "claimed_at" = NULL, "user_id" = NULL, "updated_at" = '2026-07-30 10:54:04.643128' WHERE "practitioners"."id" = 4
---
  def destroy
    user = Current.user
    practitioner = @practitioner
    email = user.email_address

    ActiveRecord::Base.transaction do
      user.update!(deleted_at: Time.current)
      practitioner.update!(user_id: nil, claimed_at: nil)