app/controllers/practitioner/gallery_images_controller.rb

  def create
    files = Array(params[:gallery_images]).reject(&:blank?)
    if files.empty?
      redirect_to practitioner_gallery_images_path, alert: "Choose at least one image to upload."
      return
    end

    remaining = Practitioner::MAX_GALLERY_IMAGES - @practitioner.gallery_images.count
    if files.size > remaining
      redirect_to practitioner_gallery_images_path,
                  alert: "You can add #{helpers.pluralize(remaining, 'more image')} (max #{Practitioner::MAX_GALLERY_IMAGES} total)."
      return
    end

    invalid = files.find { |f| !valid_upload?(f) }
    if invalid
      redirect_to practitioner_gallery_images_path,
                  alert: "Each image must be JPEG, PNG, or WebP and under 5 MB."
      return
    end

    existing_ids = @practitioner.gallery_images.attachments.pluck(:id)
    @practitioner.gallery_images.attach(files)
    new_ids = @practitioner.gallery_images.attachments.pluck(:id) - existing_ids
    @practitioner.update_column(:gallery_order, Array(@practitioner.gallery_order) + new_ids)

    redirect_to practitioner_gallery_images_path,
                notice: "#{helpers.pluralize(files.size, 'image')} added to your gallery."
---
UPDATE "practitioners" SET "gallery_order" = '[53,54,55]' WHERE "practitioners"."id" = 13
SELECT "practitioners".* FROM "practitioners" WHERE "practitioners"."id" = 13

  def reorder
    submitted = Array(params[:order]).map(&:to_i)
    valid_ids = @practitioner.gallery_images.attachments.pluck(:id)
    new_order = submitted & valid_ids
    @practitioner.update_column(:gallery_order, new_order)
---
UPDATE "practitioners" SET "gallery_order" = '[47,41,42]' WHERE "practitioners"."id" = 5