app/controllers/practitioner/profiles_controller.rb

  def update
    if @practitioner.update(profile_params)
---
UPDATE "practitioners" SET "updated_at" = '2026-07-30 13:17:44.672187', "short_tagline" = 'Licensed Acupuncturist', "services_offered" = '', "languages_spoken" = '', "qualifications" = '', "years_in_practice" = 5, "opening_hours" = '{"monday":null,"tuesday":null,"wednesday":null,"thursday":null,"friday":null,"saturday":null,"sunday":null}' WHERE "practitioners"."id" = 5

  def publish
    @practitioner.update!(published: true)
---
UPDATE "practitioners" SET "published" = TRUE, "updated_at" = '2026-07-30 10:54:03.994420' WHERE "practitioners"."id" = 4

  def unpublish
    @practitioner.update!(published: false)
---
UPDATE "practitioners" SET "published" = FALSE, "updated_at" = '2026-07-30 10:54:03.249785' WHERE "practitioners"."id" = 4