app/controllers/practitioner/settings_controller.rb

  def update_password
    unless Current.user.authenticate(params[:current_password].to_s)
      flash.now[:alert] = "Current password is incorrect."
      return render :show, status: :unprocessable_content
    end

    new_password = params[:new_password].to_s
    if new_password.length < 8
      flash.now[:alert] = "New password must be at least 8 characters."
      return render :show, status: :unprocessable_content
    end
    if new_password != params[:new_password_confirmation].to_s
      flash.now[:alert] = "Password confirmation does not match."
      return render :show, status: :unprocessable_content
    end

    Current.user.update!(password: new_password)
---
UPDATE "users" SET "password_digest" = '$2a$12$k5gSAcK.SHjxbkKEhRkHte1YgIuQKunxij5Gj/5nTICOidLGnFRji', "updated_at" = '2026-07-30 10:53:26.736768' WHERE "users"."id" = 2

  def request_email_change
    new_email = params[:new_email_address].to_s.strip.downcase
    unless new_email.match?(URI::MailTo::EMAIL_REGEXP)
      flash.now[:alert] = "Please provide a valid email address."
      return render :show, status: :unprocessable_content
    end

    if User.active.where.not(id: Current.user.id).exists?(email_address: new_email)
      flash.now[:alert] = "That email is already in use."
      return render :show, status: :unprocessable_content
    end

    Current.user.start_email_change!(new_email)
    EmailChangeMailer.with(user: Current.user).confirm.deliver_later
---
SELECT 1 AS one FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" != 2 AND "users"."email_address" = 'anna+new@example.com' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1