app/controllers/practitioner/specialty_controller.rb

  def update
    @practitioner.specialty_id = params.dig(:practitioner, :specialty_id).presence

    focus_area_ids = normalize_focus_areas(params.dig(:practitioner, :focus_area_names))
    @practitioner.focus_area_ids = focus_area_ids

    if @practitioner.save
---
INSERT INTO "practitioner_focus_areas" ("practitioner_id", "focus_area_id", "created_at", "updated_at") VALUES (13, 1, '2026-08-02 14:57:26.923981', '2026-08-02 14:57:26.923981') RETURNING "id"