app/controllers/practitioner/treatments_controller.rb

  def create
    @treatment = @practitioner.treatments.new(treatment_params)
    if @treatment.save
---
INSERT INTO "treatments" ("practitioner_id", "title", "description", "duration_minutes", "price_cents", "position", "created_at", "updated_at") VALUES (4, 'Acupuncture Session', '60-minute treatment tailored to your primary complaint.', 60, 7500, 3, '2026-07-30 13:36:04.028657', '2026-07-30 13:36:04.028657') RETURNING "id"

  def update
    if @treatment.update(treatment_params)
---
UPDATE "treatments" SET "duration_minutes" = 86, "updated_at" = '2026-08-02 09:35:20.631269' WHERE "treatments"."id" = 16

  def destroy
    @treatment.destroy
---
DELETE FROM "treatments" WHERE "treatments"."id" = 3

  def set_treatment
    @treatment = @practitioner.treatments.find(params[:id])
---
SELECT "treatments".* FROM "treatments" WHERE "treatments"."practitioner_id" = 10 AND "treatments"."id" = 16 LIMIT 1