app/helpers/public_helper.rb

  def page_description_for(practitioner)
    parts = [practitioner.specialty&.name, *practitioner.focus_areas.limit(2).pluck(:name)].compact_blank
    if parts.any?
      "#{practitioner.full_name}: #{parts.join(', ')} in #{practitioner.city}."
---
SELECT "specialties".* FROM "specialties" INNER JOIN "practitioner_specialties" ON "specialties"."id" = "practitioner_specialties"."specialty_id" WHERE "practitioner_specialties"."practitioner_id" = 3 ORDER BY "specialties"."id" ASC LIMIT 3
SELECT "focus_areas"."name" FROM "focus_areas" INNER JOIN "practitioner_focus_areas" ON "focus_areas"."id" = "practitioner_focus_areas"."focus_area_id" WHERE "practitioner_focus_areas"."practitioner_id" = 13 LIMIT 2