app/views/practitioner/profiles/_basic_info.html.erb

SELECT "specialties"."id" FROM "specialties" INNER JOIN "practitioner_specialties" ON "specialties"."id" = "practitioner_specialties"."specialty_id" WHERE "practitioner_specialties"."practitioner_id" = 4
---
          <label>
            <%= check_box_tag "practitioner[specialty_ids][]", specialty.id, @practitioner.specialty_ids.include?(specialty.id) %>