app/views/public/home/_practitioner_card.html.erb

SELECT "practitioner_focus_areas".* FROM "practitioner_focus_areas" WHERE "practitioner_focus_areas"."practitioner_id" IN (12, 4, 13, 3, 11, 5, 8, 7, 10, 6, 9)
---

  <% if practitioner.focus_areas.any? %>