app/views/public/claims/show.html.erb

SELECT "practitioners".* FROM "practitioners" WHERE "practitioners"."id" = 4 LIMIT 1
SELECT 1 AS one FROM "specialties" INNER JOIN "practitioner_specialties" ON "specialties"."id" = "practitioner_specialties"."specialty_id" WHERE "practitioner_specialties"."practitioner_id" = 4 LIMIT 1
SELECT "specialties".* FROM "specialties" INNER JOIN "practitioner_specialties" ON "specialties"."id" = "practitioner_specialties"."specialty_id" WHERE "practitioner_specialties"."practitioner_id" = 4 ORDER BY "specialties"."id" ASC LIMIT 3
---
        <p class="muted"><%= @invitation.practitioner.city %></p>
        <% if @invitation.practitioner.specialties.any? %>
          <div class="row mt-16" style="gap: 4px;">
            <% @invitation.practitioner.specialties.first(3).each do |s| %>