app/views/practitioner/settings/show.html.erb

  <p class="form-section__hint">
    Your current sign-in email is <strong><%= Current.user.email_address %></strong>.
    <% if Current.user.pending_email_address.present? && !Current.user.email_change_expired? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1