app/models/claim_invitation.rb

UPDATE "claim_invitations" SET "expires_at" = '2026-07-30 10:08:30.436932' WHERE "claim_invitations"."claimed_at" IS NULL AND (expires_at > '2026-07-30 10:08:31.436873') AND "claim_invitations"."practitioner_id" = 4
---
  def self.invalidate_pending_for(practitioner)
    pending.where(practitioner_id: practitioner.id).update_all(expires_at: 1.second.ago)

SELECT 1 AS one FROM "claim_invitations" WHERE "claim_invitations"."unique_token" = 'S2Exzzi_TBmXKeod1UNVQXUAVwWTCBtilZSKtZyv2F0' LIMIT 1
---
  def generate_token
    return if unique_token.present?
    loop do
      candidate = SecureRandom.urlsafe_base64(TOKEN_BYTES)
      unless self.class.exists?(unique_token: candidate)