app/models/focus_area.rb

INSERT INTO "focus_areas" ("name", "slug", "created_at", "updated_at") VALUES ('sports massage', 'sports-massage', '2026-08-02 14:57:26.904059', '2026-08-02 14:57:26.904059') RETURNING "id"
SELECT 1 AS one FROM "focus_areas" WHERE LOWER("focus_areas"."name") = LOWER('sports massage') LIMIT 1
SELECT "focus_areas".* FROM "focus_areas" WHERE (LOWER(name) = 'sports massage') ORDER BY "focus_areas"."id" ASC LIMIT 1
---
  def self.find_or_create_by_name(raw_name)
    normalized = raw_name.to_s.strip.squeeze(" ")
    return nil if normalized.blank?
    existing = where("LOWER(name) = ?", normalized.downcase).first