app/models/practitioner.rb

SELECT 1 AS one FROM "treatments" WHERE "treatments"."practitioner_id" = 5 LIMIT 1
---
  def missing_premium_fields
    missing = []
    missing << "profile photo"    unless profile_photo.attached?
    missing << "short tagline"    if short_tagline.blank?
    missing << "long bio"         if long_bio.body.blank?
    missing << "treatments"       if treatments.empty?

SELECT 1 AS one FROM "practitioners" WHERE "practitioners"."id" != 5 AND "practitioners"."slug" = 'james-liu-munchen' LIMIT 1
---
  def assign_slug
    return if slug.present? && !full_name_changed? && !city_changed?

SELECT 1 AS one FROM "practitioners" WHERE "practitioners"."id" != 0 AND "practitioners"."slug" = 'james-liu-munich' LIMIT 1
---
    scope = self.class.where.not(id: id || 0)
    while scope.exists?(slug: candidate)