app/models/practitioner.rb

  def self.find_potential_match(full_name, city)
    return nil if full_name.blank? || city.blank?
    normalized_name = normalize_name(full_name)
    normalized_city = I18n.transliterate(city.to_s).downcase.strip
    return nil if normalized_name.blank? || normalized_city.blank?

    find_each.find do |p|
---
SELECT "practitioners".* FROM "practitioners" ORDER BY "practitioners"."id" ASC LIMIT 1000

    scope = self.class.where.not(id: id || 0)
    while scope.exists?(slug: candidate)
---
SELECT 1 AS one FROM "practitioners" WHERE "practitioners"."id" != 0 AND "practitioners"."slug" = 'david-klein-dresden' LIMIT 1