app/models/treatment.rb

  def assign_position
    return unless position.nil?
    max = practitioner&.treatments&.where.not(id: id)&.maximum(:position) || -1
---
SELECT MAX("treatments"."position") FROM "treatments" WHERE "treatments"."practitioner_id" = 4 AND "treatments"."id" IS NOT NULL