app/models/user.rb

  def self.authenticate_by(attrs)
    active.find_by(email_address: attrs[:email_address])&.authenticate(attrs[:password]) || nil
---
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."email_address" = 'anna@example.com' LIMIT 1

  def confirm_email_change!
    return false if pending_email_address.blank?
---
SELECT 1 AS one FROM "users" WHERE LOWER("users"."email_address") = LOWER('anna@example.com') AND "users"."id" != 2 LIMIT 1

  def generate_email_change_token
    loop do
      candidate = SecureRandom.urlsafe_base64(32)
      break candidate unless self.class.where.not(id: id).exists?(email_change_token: candidate)
---
SELECT 1 AS one FROM "users" WHERE "users"."id" != 2 AND "users"."email_change_token" = 'H2G6Kv13ZjMxGtOHDlgeQDb_IytBWnG35wlI5BlPOM0' LIMIT 1