app/views/practitioner/dashboard/show.html.erb

  <%= link_to practitioner_treatments_path, class: "dashboard-tile" do %>
    <span class="dashboard-tile__label">Treatments (<%= @practitioner.treatments.count %>)</span>
---
SELECT COUNT(*) FROM "treatments" WHERE "treatments"."practitioner_id" = 4